{"title":"The Rain","uid":"ecd9dcece960ca36f627c8b8c8ab95c2","slug":"the-rain","date":"2022-01-21T22:45:09.000Z","updated":"2022-01-23T05:27:53.723Z","comments":true,"path":"api/articles/the-rain.json","keywords":["Coding","Technology","Art","OI","Louis Aeilot","Literature","Photography","Science"],"cover":"https://images.unsplash.com/photo-1541611539527-2c243ae7428a?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=1295&q=80","content":"<p>Written in 2018 as an assignment for my English class (English as a foreign language). Due to poor skill and the lack of experience, grammartical mistakes might be made. Be free to point them out!</p>\n<span id=\"more\"></span>\n\n<p>I come to my hometown to play. The weather there isn’t very dry. It often rains though in winter.</p>\n<p>It’s a rainy day today. It smells like something fresh in spring – the earth. And my sneakers are sopping. It’s raining gently outside and the sky is still bright. I love rainy days. They’re blissful days when the plants are sucking the raindrops falling from above the vast plains in the sky. I always stay inside my wooden cottage and do nothing but staring outside. I enjoy the rain. The raindrops hit the roof of my barn and makes me happy. It is as if playing a pop song.</p>\n<p>However, rain brings trouble as well. I feel isolated from the outside world, especially my friends that are awaiting me to play. I hear the wind weeping when I think of not being able to go outdoors, although my pet spaniel keeps me company.</p>\n<p>Nevertheless, it’s not too bad since the rain comes with solitude. Often do I read books inside by the fireplace. This feeling is wonderful.</p>\n<p>I don’t know whether rainy days are happy days or lonely days. Anyway, I love these days.</p>\n","text":"Written in 2018 as an assignment for my English class (English as a foreign language). Due to poor skill and the lack of experience, grammar...","link":"","photos":[],"count_time":{"symbolsCount":"1.2k","symbolsTime":"1 mins."},"categories":[{"name":"Essay","slug":"Essay","count":2,"path":"api/categories/Essay.json"}],"tags":[],"toc":"","author":{"name":"Louis Aeilot","slug":"blog-author","avatar":"/images/gravatar.jpeg","link":"/","description":"Stay Hungry. Stay Foolish.","socials":{"github":"https://github.com/aeilot","twitter":"https://twitter.com/aeilot","stackoverflow":"https://stackoverflow.com/13011108","wechat":"","qq":"","weibo":"","zhihu":"","csdn":"","juejin":"","customs":{}}},"mapped":true,"prev_post":{},"next_post":{}}